app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."topic_id" = $1  [["topic_id", 1]]
---
  def index
    @message = Message.where(topic_id: @topic.id)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "topic_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ""], ["topic_id", 1], ["user_id", 1], ["created_at", "2020-07-19 16:30:32.833815"], ["updated_at", "2020-07-19 16:30:32.833815"]]
---
  def create
    @message = Message.new(message_params)
    @topic = Topic.find(params[:topic_id])
    @message.topic = @topic
    @message.user = @current_user
    if @message.save

UPDATE "messages" SET "content" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["content", "1000mph"], ["updated_at", "2020-07-15 19:59:48.601161"], ["id", 4]]
---
  def update
    if @message.user_id == @current_user.id
    if @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 7]]
---
  def destroy
   if @message.user_id == @current_user.id
     @message.destroy

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_topic
    @topic = Topic.find(params[:topic_id])