app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def sender_of_message
    @message = Message.all
    # @send = User.where()
    @user = User.find(params[:id])