app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "News"], ["created_at", "2020-07-16 01:56:14.986334"], ["updated_at", "2020-07-16 01:56:14.986334"]]